In [2]:
import pandas as pd
import numpy as np

In [3]:
dict1 ={
    "name": ['Arnab','Jit','Ankush','Aritra'],
    'Marks':[95,60,89,98],
    'City':['Howrah','Kolkata','Mumbai','London']
}

In [4]:
df = pd.DataFrame(dict1) #create dataframe which has index and arranged data in row and col wise

In [5]:
df

     name  Marks     City
0   Arnab     95   Howrah
1     Jit     60  Kolkata
2  Ankush     89   Mumbai
3  Aritra     98   London

In [7]:
df.to_csv('friends.csv') #create a csv file which contains dataframe

In [8]:
df.to_csv('friends_index_false.csv', index=False)

In [9]:
df.head(2) #print first 2 row

    name  Marks     City
0  Arnab     95   Howrah
1    Jit     60  Kolkata

In [10]:
df.tail(2) #print last 2 row

     name  Marks    City
2  Ankush     89  Mumbai
3  Aritra     98  London

In [12]:
df.describe() #it will describe all statistical function

           Marks
count   4.000000
mean   85.500000
std    17.406895
min    60.000000
25%    81.750000
50%    92.000000
75%    95.750000
max    98.000000

In [16]:
read = pd.read_csv('Read_file.csv') #to read a csv file from machine

In [17]:
read

  Phone Model  price  Launch_Year  Battery(MAH)
0        Poco  15000         2022          6000
1       Nokia   8000         2021          4000
2     Samsung  10000         2008          5000
3          Mi  12000         2010          6500
4        Vivo  16000         2016          7000

In [19]:
read.describe()

              price  Launch_Year  Battery(MAH)
count      5.000000     5.000000      5.000000
mean   12200.000000  2015.400000   5700.000000
std     3346.640106     6.308724   1204.159458
min     8000.000000  2008.000000   4000.000000
25%    10000.000000  2010.000000   5000.000000
50%    12000.000000  2016.000000   6000.000000
75%    15000.000000  2021.000000   6500.000000
max    16000.000000  2022.000000   7000.000000

In [20]:
read['price']

0    15000
1     8000
2    10000
3    12000
4    16000
Name: price, dtype: int64

In [21]:
read['price'][0] = 1110 # to change a value

C:\Users\Arnab\AppData\Local\Temp\ipykernel_10384\790399041.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  read['price'][0] = 1110

In [22]:
read

  Phone Model  price  Launch_Year  Battery(MAH)
0        Poco   1110         2022          6000
1       Nokia   8000         2021          4000
2     Samsung  10000         2008          5000
3          Mi  12000         2010          6500
4        Vivo  16000         2016          7000

In [24]:
read.to_csv('Read_file.csv')

In [29]:
read.index = ['First','Second','Third','Fourth','Fifth'] #customize the indexing

In [30]:
read

       Phone Model  price  Launch_Year  Battery(MAH)
First         Poco   1110         2022          6000
Second       Nokia   8000         2021          4000
Third      Samsung  10000         2008          5000
Fourth          Mi  12000         2010          6500
Fifth         Vivo  16000         2016          7000